Revit 2024 API
PrimaryDesignOptionMemberFilter Members
The PrimaryDesignOptionMemberFilter type exposes the following members.
Constructors
Name | Description
PrimaryDesignOptionMemberFilter()
 Constructs a new instance of a filter to match elements contained in any primary design option of any design option set.
PrimaryDesignOptionMemberFilter(Boolean)
 Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
PrimaryDesignOptionMemberFilter Class
Autodesk.Revit.DB Namespace